import React from "react";
import "./FAQ.css";
const FAQ = () => {
  return (
    <div>
      <div className="faq">
        <h2>FAQ. 01: Context API কি এবং এর ব্যবহার বর্ণনা কর।</h2>
        <p>
            Context API হল React এর একটি নতুন ফিচার যেটা React v16.3 থেকে যুক্ত হয়েছে। এই API অনেকটা রিডাক্সের মতোই কাজ করে। তবে ঠিক রিডাক্স না, বরং এটার কার্যপ্রণালী অন্যরকম। এটি ব্যবহার করে সমগ্র React অ্যাপের মধ্যে কোন একটি State কে একবার লিখে সেটি শেয়ার করে বারবার ব্যবহার করা যাই। 
        </p>
        <p>
        সাধারণত, আমরা কোন JSX Component থেকে ডাটা প্রেরণ ও গ্রহণ করার জন্য props ব্যবহার করি। প্যারেন্ট Component থেকে Attribute আকারে কোন value প্রেরণ করে তাকে Child Component এর প্যারামিটার থেকে props এর মাধ্যমে গ্রহণ করে থাকি। এভাবে ডাটা প্রেরণ ও গ্রহণ আপাত দৃষ্টিতে কোন সমস্যা মনে না হলেও বড় বড় প্রজেক্ট এর ক্ষেত্রে প্রায়শই এটা একটা বিরক্তকর সমস্যার সৃষ্টি করে। যেমনঃ আমি কোন Component এর ডাটাকে তার Child এর Child এর Child এর Child Component কে প্রেরণ করতে চাই, আমরা জানি এটার জন্য আমাদের প্রতিটা Component এ props গ্রহণ করে সেই ডাটাকে আবার তার Child কে প্রেরণ করতে হয় আর এভাবে চলতে থাকে যতক্ষণ আমাদের কাঙ্ক্ষিত গন্তব্যে পৌঁছাতে না পারি। একটু ভেবে দেখুন, ডাটা প্রেরণ করতে হবে একটা Component থেকে আরেকটা Component এ কিন্তু মাঝে অনেকগুলো প্যারেন্ট, চাইল্ড থাকার কারনে অযথা সময় নষ্ট, বেশি কোড ও কোডের জটিলতা বৃদ্ধির কারনে পারফারমেন্সেও সেটার প্রভাব ফেলে। এই সমস্যার সমাধান হিসেবে আসেঃ React এর Context API।
        </p>
      </div>
      <div className="faq">
        <h2>FAQ. 02: Semantic Tag কি?</h2>
        <p>
        Semantic Tag বা Tag কথা আসলেই প্রথমে আমাদের মাথায় যেটি আসে তা হল HTML (হাইপার টেক্সট মার্কআপ ল্যাঙ্গুয়েজ)। আমরা জানি, HTML এর এখন পর্যন্ত HTML 5 এর আগে ছিল HTML 4। Semantic বা Semantic Tag এর উদ্ভব হয় মূলত HTML 5 এ। সহজ কথা Semantic Tag বলতে কাজের সাথে অর্থবোধক নামের অধিকারী Tag সমূহকে বুঝায়। নিম্নে লিস্ট আকারে দেয়া হলোঃ{" "}
        </p>
        <table>
          <thead>
            <tr>
              <th>ট্যাগ</th>
              <th>বর্ণনা</th>
            </tr>
          </thead>
          <tbody>
            <tr>
              <td>
                article{" "}
              </td>
              <td>একটি আর্টিকেল বুঝায়</td>
            </tr>
            <tr>
              <td>aside</td>
              <td>একটি পেজ কন্টেন্টের পাশের কন্টেন্টকে বুঝায়</td>
            </tr>
            <tr>
              <td>dtails</td>
              <td>ইউজারকে দেখানোর জন্য অতিরিক্ত তথ্যকে বুঝায় </td>
            </tr>
            <tr>
              <td>figure </td>
              <td>
              ক্যাপশনসহ একটি এলিমেন্টকে বুঝায়
              </td>
            </tr>
            <tr>
              <td>footer </td>
              <td>ডকুমেন্ট অথবা সেকশনের ফুটার নির্দেশ করে</td>
            </tr>
            <tr>
              <td>header </td>
              <td>ডকুমেন্ট অথবা সেকশনের হেডার নির্দেশ করে</td>
            </tr>
          </tbody>
        </table>
      </div>
    </div>
  );
};

export default FAQ;
