import React from "react";
import "./FAQ.css";
const FAQ = () => {
  return (
    <div>
      <div className="faq">
        <h2>FAQ. 01: Context API কি এবং এর ব্যবহার বর্ণনা কর।</h2>
        <p>
            Context API হল React এর একটি নতুন ফিচার যেটা React v16.3 থেকে যুক্ত হয়েছে। এই API অনেকটা রিডাক্সের মতোই কাজ করে। তবে ঠিক রিডাক্স না, বরং এটার কার্যপ্রণালী অন্যরকম। এটি ব্যবহার করে সমগ্র React অ্যাপের মধ্যে কোন একটি State কে একবার লিখে সেটি শেয়ার করে বারবার ব্যবহার করা যাই। 
        </p>
        <p>
        আমরা রিঅ্যাক্ট এ সাধারণত একটা কম্পোনেন্ট থেকে আরেকটা কম্পোনেন্ট এ ডাটা সেন্ড করি। সেক্ষেত্রে একটা কম্পোনেন্ট এর ডাটা আরেকটা চাইল্ড কম্পোনেন্ট এ প্রপস হিসাবে পাঠাতে হয়। অনেকসময় এরকম সিচুয়েশন আসে যে আমাদের মেইন কম্পোনেন্ট যেখানে আপনার ডাটা রয়েছে সেখান থেকে চাইল্ড কম্পোনেন্ট অনেক লেভেল নিচে থাকে। মানে ঐ ডাটাওয়ালা কম্পোনেন্ট এর আরেকটা চাইল্ড কম্পোনেন্ট আছে, আবার সেই চাইল্ড কম্পোনেন্ট এর আবার আরেকটা চাইল্ড কম্পোনেন্ট আছে। 
        
        <p>
          
        এভাবে করতে করতে অনেকগুলা চাইল্ড থাকতে পারে। এখন আমরা মেইন কম্পোনেন্ট বা আমরা যেটাকে বলি টপ লেভেল কম্পোনেন্ট থেকে ডাটা অনেক লেভেল নিচের কোনো চাইল্ড কম্পোনেন্ট এ নিতে চাই, তাহলে আমাদের সেই চাইল্ড কম্পোনেন্ট এর প্যারেন্ট এবং সেই প্যারেন্ট এর প্যারেন্ট এভাবে করতে করতে ডাটাওয়ালা কম্পোনেন্ট এ বা টপ লেভেল কম্পোনেন্ট পর্যন্ত সবগুলার হেল্প নিতে হবে ডাটা পাস করার জন্যে। এটাকে খুড়তে খুড়তে ডাটা নেওয়ার মতো বলা যায়। এরকম সিচুয়েশনে আমরা রিডাক্স ইউজ করি সাধারণত। বা সিচুয়েশান এর চেয়েও জটিল হতে পারে। সেক্ষেত্রে আমরা এরকম গ্লোবাল স্ট্যাট রাখি যেটা পরে যেকোনো চাইল্ডই চাইলে অ্যাক্সেস করতে পারে, খুড়ে খুড়ে সব কম্পোনেন্ট এ প্রপস হিসাবে পাস করে ডাটা নিতে হয় না।
        </p>
        </p>
      </div>
      <div className="faq">
        <h2>FAQ. 02: Semantic Tag কি?</h2>
        <p>
        HTML5 সিমেন্টিক Tag গুলো HTML এ নতুন করে যোগ হয়েছে যা HTML5 আর সেগুলো হচ্ছে aside, article, section header footer সহ আরো বেশ কিছু HTML Tag আছে যেগুলো semantic Tag. নিম্নে লিস্ট আকারে দেয়া হলোঃ{" "}
        </p>
        <table>
          <thead>
            <tr>
              <th>ট্যাগ</th>
              <th>বর্ণনা</th>
            </tr>
          </thead>
          <tbody>
            <tr>
              <td>
                article{" "}
              </td>
              <td>একটি আর্টিকেল বুঝায়</td>
            </tr>
            <tr>
              <td>aside</td>
              <td>একটি পেজ কন্টেন্টের পাশের কন্টেন্টকে বুঝায়</td>
            </tr>
            <tr>
              <td>dtails</td>
              <td>ইউজারকে দেখানোর জন্য অতিরিক্ত তথ্যকে বুঝায় </td>
            </tr>
            <tr>
              <td>figure </td>
              <td>
              ক্যাপশনসহ একটি এলিমেন্টকে বুঝায়
              </td>
            </tr>
            <tr>
              <td>footer </td>
              <td>ডকুমেন্ট অথবা সেকশনের ফুটার নির্দেশ করে</td>
            </tr>
            <tr>
              <td>header </td>
              <td>ডকুমেন্ট অথবা সেকশনের হেডার নির্দেশ করে</td>
            </tr>
          </tbody>
        </table>
      </div>
    </div>
  );
};

export default FAQ;
